
void menu() {
    wcout << L"=== Главное Меню ===" << endl;
    wcout << L"1. Купить животное" << endl;
    wcout << L"2. Купить работника" << endl;
    wcout << L"3. Назначить работника на вольер" << endl;
    wcout << L"4. Разместить животное в вольер" << endl;
    wcout << L"5. Купить вольер" << endl;
    wcout << L"6. Купить еду" << endl;
    wcout << L"7. Продать животное" << endl;
    wcout << L"8. Купить популярность" << endl;
    wcout << L"9. Вывести информацию о животных" << endl;
    wcout << L"10. Вывести информацию о вольерах" << endl;
    wcout << L"11. Вывести информацию о работниках" << endl;
    wcout << L"12. Завершить день" << endl;
    wcout << L"13. Размножить животных" << endl;
    wcout << L"14. улучшить волеры" << endl;
    wcout << L"Выберите опцию: ";
}

